In [1]:
import pandas as pd

In [3]:
import numpy as np
import pandas as pd
arr=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(arr,columns=["a","b","c"])
df

   a  b  c
0  1  2  3
1  4  5  6

In [3]:
pip install openpyxl

Requirement already satisfied: openpyxl in /home/rguktrkvalley/test/notebookenv/lib/python3.8/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/rguktrkvalley/test/notebookenv/lib/python3.8/site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
df=pd.read_excel("/home/rguktrkvalley/Desktop/sales.xlsx")
print(df)

  product name  Quarter 1  Quarter 2  Quarter 3
0        apple        450        330        872
1       banana        186        680        698
2        mango        123        870        780
3       orange        158        960        980
4       grapes        148        360        750
5    pineapple        654        450        785
6      avocado        896        658        950
7       olives        325        550        650
8        total       3815       5616       6915

In [5]:
print("the index for above file is: ",df.index)

the index for above file is:  RangeIndex(start=0, stop=9, step=1)

In [8]:
print("column names are: ",df.columns)

column names are:  Index(['product name', 'Quarter 1', 'Quarter 2', 'Quarter 3'], dtype='object')

In [9]:
print(df.head(3))

  product name  Quarter 1  Quarter 2  Quarter 3
0        apple        450        330        872
1       banana        186        680        698
2        mango        123        870        780

In [7]:
#renaming row
df.rename({0:"zero"},axis=0)

     product name  Quarter 1  Quarter 2  Quarter 3
zero        apple        450        330        872
1          banana        186        680        698
2           mango        123        870        780
3          orange        158        960        980
4          grapes        148        360        750
5       pineapple        654        450        785
6         avocado        896        658        950
7          olives        325        550        650
8           total       3815       5616       6915

In [12]:
#to select - particular column
df1=pd.read_excel("/home/rguktrkvalley/Desktop/sales.xlsx", header= None )
print(df1)

              0          1          2          3
0  product name  Quarter 1  Quarter 2  Quarter 3
1         apple        450        330        872
2        banana        186        680        698
3         mango        123        870        780
4        orange        158        960        980
5        grapes        148        360        750
6     pineapple        654        450        785
7       avocado        896        658        950
8        olives        325        550        650
9         total       3815       5616       6915

In [13]:
#to change datatype of particular column
df2=pd.read_excel("/home/rguktrkvalley/Desktop/sales.xlsx", dtype={"Quarter 1":float})
print(df2)

  product name  Quarter 1  Quarter 2  Quarter 3
0        apple      450.0        330        872
1       banana      186.0        680        698
2        mango      123.0        870        780
3       orange      158.0        960        980
4       grapes      148.0        360        750
5    pineapple      654.0        450        785
6      avocado      896.0        658        950
7       olives      325.0        550        650
8        total     3815.0       5616       6915

In [ ]:
#creating csv file and printing it

In [14]:
df3=pd.read_csv("/home/rguktrkvalley/Desktop/books.csv")
print(df3)

   textbooks  quantity  cost  revenue
0      maths       321   250    16050
1    english       500   180    72000
2      hindi       200   120    18000
3    physics       620   420   133080
4  chemistry       500   300    13500
5    biology       300   128     9500
6   accounts       200   200    16050
7  economics       180   250  1015000

In [15]:
print(df3.tail(2))

   textbooks  quantity  cost  revenue
6   accounts       200   200    16050
7  economics       180   250  1015000

In [16]:
print(df3.head(2))

  textbooks  quantity  cost  revenue
0     maths       321   250    16050
1   english       500   180    72000

In [17]:
df3=df3.rename({"cost":"price"},axis=1)
print(df3)

   textbooks  quantity  price  revenue
0      maths       321    250    16050
1    english       500    180    72000
2      hindi       200    120    18000
3    physics       620    420   133080
4  chemistry       500    300    13500
5    biology       300    128     9500
6   accounts       200    200    16050
7  economics       180    250  1015000

In [18]:
#printing single column
print(df3["textbooks"])

0        maths
1      english
2        hindi
3      physics
4    chemistry
5      biology
6     accounts
7    economics
Name: textbooks, dtype: object

In [19]:
print(df3.shape)

(8, 4)

In [20]:
#adding column or row
df3.loc[8]=["social",300,200,60000]
print(df3)

   textbooks  quantity  price  revenue
0      maths       321    250    16050
1    english       500    180    72000
2      hindi       200    120    18000
3    physics       620    420   133080
4  chemistry       500    300    13500
5    biology       300    128     9500
6   accounts       200    200    16050
7  economics       180    250  1015000
8     social       300    200    60000

In [21]:
#downloding dataframe from kaggle and impotinig it
df4=pd.read_csv("/home/rguktrkvalley/Desktop/data.csv")
print(df4)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [22]:
df4.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0

In [17]:
df4.tail(2)

     Duration  Pulse  Maxpulse  Calories
167        75    120       150     320.4
168        75    125       150     330.4

In [23]:
df4=df4.rename({"Duration":"time"},axis=1)
print(df4)

     time  Pulse  Maxpulse  Calories
0      60    110       130     409.1
1      60    117       145     479.0
2      60    103       135     340.0
3      45    109       175     282.4
4      45    117       148     406.0
..    ...    ...       ...       ...
164    60    105       140     290.8
165    60    110       145     300.0
166    60    115       145     310.2
167    75    120       150     320.4
168    75    125       150     330.4

[169 rows x 4 columns]

In [11]:
#expoting it back
df4.to_csv("/home/rguktrkvalley/Desktop/calories.csv")